src/Documents/ИС_ЯМ_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_ЯМ_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>itemsTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>total</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serviceName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recipient</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cancelRequested</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоDBS</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_МодельРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураЯМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодЯМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_Штрихкоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>count</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>shipmentDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_ЯМ_Заказ/Forms/ФормаНастройкиЛистаПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
		Возврат;
	КонецЕсли;
	
	МассивЗначений = Новый Массив;	
	МассивЗначений.Добавить("ПечататьАртикул1С");   
	МассивЗначений.Добавить("ПечататьАртикулЯМ");
	МассивЗначений.Добавить("ПечататьКоличество");   
	МассивЗначений.Добавить("ПечататьНазвание");
	МассивЗначений.Добавить("ПечататьНомерРеализации");
	//+ ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168       
	МассивЗначений.Добавить("ПечататьНомерЗаказа"); 
	МассивЗначений.Добавить("ПечататьНомерСтроки");   
	//- ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
	МассивЗначений.Добавить("ПечататьНомерСборочного");	
	МассивЗначений.Добавить("ПечататьРазмер");	
	МассивЗначений.Добавить("ПечататьШтрихкод");	
	МассивЗначений.Добавить("ПечататьФото");	
	
	Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивЗначений);
		
	Если Результат.Количество() = 0 Тогда		
		ПечататьАртикулЯМ 			= Истина;				
		ПечататьНазвание 			= Истина;
		ПечататьНомерСборочного 	= Истина;		
		ПечататьРазмер 				= Истина;		
		ПечататьШтрихкод		 	= Истина;
		ПечататьФото			 	= Истина;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967

#КонецОбласти

#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967
&НаКлиенте
Процедура СохранитьДанные(Команда)
	СохранитьДанныеНаСервере(Профиль);
	Закрыть();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967
&НаСервере 
Процедура СохранитьДанныеНаСервере(Профиль)
	
	СтруктураРезультатовЗначение = Новый Структура;	
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикул1С", ПечататьАртикул1С);
	СтруктураРезультатовЗначение.Вставить("ПечататьАртикулЯМ", ПечататьАртикулЯМ);		
	СтруктураРезультатовЗначение.Вставить("ПечататьКоличество", ПечататьКоличество);
	СтруктураРезультатовЗначение.Вставить("ПечататьНазвание", ПечататьНазвание); 
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерРеализации", ПечататьНомерРеализации);
	//+ ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерЗаказа", ПечататьНомерЗаказа);
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСтроки", ПечататьНомерСтроки); 
	//- ИнфоСофт Стояк Ю.К. 09.02.2025 УА #77168
	СтруктураРезультатовЗначение.Вставить("ПечататьНомерСборочного", ПечататьНомерСборочного);
	СтруктураРезультатовЗначение.Вставить("ПечататьРазмер", ПечататьРазмер);	
	СтруктураРезультатовЗначение.Вставить("ПечататьШтрихкод", ПечататьШтрихкод);
	СтруктураРезультатовЗначение.Вставить("ПечататьФото", ПечататьФото);

	ИС_MP_Сервер.ЗаписатьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, СтруктураРезультатовЗначение);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.10.24 УА #84967

#КонецОбласти
